; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v13 ?v11)
             (pred_6 ?v4 ?v9)
             (pred_4 ?v13 ?v9)
             (pred_8 ?v12 ?v13 )
	     (pred_5 ?v13)
             (pred_2 ?v5)
             (pred_9 ?v4)
             (pred_10 ?v9)
             (pred_7 ?v13)
             (pred_3 ?v4)
             (pred_12 ?v13)
             (pred_1 ))



(:action op_1
:parameters (?v6 ?v1 ?v10 ?v7)
:precondition (and (pred_2 ?v6) (pred_2 ?v1) (pred_9 ?v10) (pred_10 ?v7)
          (pred_11 ?v6 ?v1) (pred_6 ?v10 ?v7)
                   (pred_4 ?v1 ?v7) (pred_5 ?v6) 
                   (pred_7 ?v1) (pred_3 ?v10))
:effect (and  (pred_12 ?v1) (not (pred_7 ?v1))))


(:action op_5
:parameters (?v6 ?v8)
:precondition (and (pred_2 ?v6) (pred_2 ?v8)
               (pred_5 ?v6) (pred_11 ?v6 ?v8) (pred_12 ?v8))
:effect (and (pred_5 ?v8) (not (pred_5 ?v6))))

(:action op_3
:parameters (?v6 ?v10)
:precondition (and (pred_2 ?v6) (pred_9 ?v10) 
                  (pred_5 ?v6) (pred_8 ?v10 ?v6) (pred_1 ))
:effect (and (pred_3 ?v10)
   (not (pred_8 ?v10 ?v6)) (not (pred_1 ))))


(:action op_2
:parameters (?v6 ?v3 ?v2)
:precondition (and (pred_2 ?v6) (pred_9 ?v3) (pred_9 ?v2)
                  (pred_5 ?v6) (pred_3 ?v2) (pred_8 ?v3 ?v6))
:effect (and (pred_3 ?v3) (pred_8 ?v2 ?v6)
        (not (pred_3 ?v2)) (not (pred_8 ?v3 ?v6))))

(:action op_4
:parameters (?v6 ?v10)
:precondition (and (pred_2 ?v6) (pred_9 ?v10) 
                  (pred_5 ?v6) (pred_3 ?v10))
:effect (and (pred_1 ) (pred_8 ?v10 ?v6) (not (pred_3 ?v10)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_24 obj_12 obj_14 obj_11 obj_25 obj_06 obj_20 obj_22 obj_03 obj_08 obj_15 obj_28 obj_21 obj_10 obj_26 obj_23 obj_19 obj_05 obj_01 obj_30 obj_17 obj_16 obj_29 obj_13 obj_04
    obj_27 obj_07 obj_31
    obj_09 obj_02 obj_18
    )

    (:init
       (pred_1)

       (pred_2 obj_24)
       (pred_2 obj_12)
       (pred_2 obj_14)
       (pred_2 obj_11)
       (pred_2 obj_25)
       (pred_2 obj_06)
       (pred_2 obj_20)
       (pred_2 obj_22)
       (pred_2 obj_03)
       (pred_2 obj_08)
       (pred_2 obj_15)
       (pred_2 obj_28)
       (pred_2 obj_21)
       (pred_2 obj_10)
       (pred_2 obj_26)
       (pred_2 obj_23)
       (pred_2 obj_19)
       (pred_2 obj_05)
       (pred_2 obj_01)
       (pred_2 obj_30)
       (pred_2 obj_17)
       (pred_2 obj_16)
       (pred_2 obj_29)
       (pred_2 obj_13)
       (pred_2 obj_04)
       (pred_10 obj_27)
       (pred_10 obj_07)
       (pred_10 obj_31)
       (pred_9 obj_09)
       (pred_9 obj_02)
       (pred_9 obj_18)

       (pred_11 obj_24 obj_06)
       (pred_11 obj_24 obj_12)
       (pred_11 obj_12 obj_20)
       (pred_11 obj_12 obj_14)
       (pred_11 obj_12 obj_24)
       (pred_11 obj_14 obj_22)
       (pred_11 obj_14 obj_11)
       (pred_11 obj_14 obj_12)
       (pred_11 obj_11 obj_03)
       (pred_11 obj_11 obj_25)
       (pred_11 obj_11 obj_14)
       (pred_11 obj_25 obj_08)
       (pred_11 obj_25 obj_11)
       (pred_11 obj_06 obj_15)
       (pred_11 obj_06 obj_20)
       (pred_11 obj_06 obj_24)
       (pred_11 obj_20 obj_28)
       (pred_11 obj_20 obj_22)
       (pred_11 obj_20 obj_12)
       (pred_11 obj_20 obj_06)
       (pred_11 obj_22 obj_21)
       (pred_11 obj_22 obj_03)
       (pred_11 obj_22 obj_14)
       (pred_11 obj_22 obj_20)
       (pred_11 obj_03 obj_10)
       (pred_11 obj_03 obj_08)
       (pred_11 obj_03 obj_11)
       (pred_11 obj_03 obj_22)
       (pred_11 obj_08 obj_26)
       (pred_11 obj_08 obj_25)
       (pred_11 obj_08 obj_03)
       (pred_11 obj_15 obj_23)
       (pred_11 obj_15 obj_28)
       (pred_11 obj_15 obj_06)
       (pred_11 obj_28 obj_19)
       (pred_11 obj_28 obj_21)
       (pred_11 obj_28 obj_20)
       (pred_11 obj_28 obj_15)
       (pred_11 obj_21 obj_05)
       (pred_11 obj_21 obj_10)
       (pred_11 obj_21 obj_22)
       (pred_11 obj_21 obj_28)
       (pred_11 obj_10 obj_01)
       (pred_11 obj_10 obj_26)
       (pred_11 obj_10 obj_03)
       (pred_11 obj_10 obj_21)
       (pred_11 obj_26 obj_30)
       (pred_11 obj_26 obj_08)
       (pred_11 obj_26 obj_10)
       (pred_11 obj_23 obj_17)
       (pred_11 obj_23 obj_19)
       (pred_11 obj_23 obj_15)
       (pred_11 obj_19 obj_16)
       (pred_11 obj_19 obj_05)
       (pred_11 obj_19 obj_28)
       (pred_11 obj_19 obj_23)
       (pred_11 obj_05 obj_29)
       (pred_11 obj_05 obj_01)
       (pred_11 obj_05 obj_21)
       (pred_11 obj_05 obj_19)
       (pred_11 obj_01 obj_13)
       (pred_11 obj_01 obj_30)
       (pred_11 obj_01 obj_10)
       (pred_11 obj_01 obj_05)
       (pred_11 obj_30 obj_04)
       (pred_11 obj_30 obj_26)
       (pred_11 obj_30 obj_01)
       (pred_11 obj_17 obj_16)
       (pred_11 obj_17 obj_23)
       (pred_11 obj_16 obj_29)
       (pred_11 obj_16 obj_19)
       (pred_11 obj_16 obj_17)
       (pred_11 obj_29 obj_13)
       (pred_11 obj_29 obj_05)
       (pred_11 obj_29 obj_16)
       (pred_11 obj_13 obj_04)
       (pred_11 obj_13 obj_01)
       (pred_11 obj_13 obj_29)
       (pred_11 obj_04 obj_30)
       (pred_11 obj_04 obj_13)
       (pred_7 obj_08)
       (pred_7 obj_26)
       (pred_7 obj_15)
       (pred_4  obj_08 obj_27)
       (pred_4  obj_26 obj_07)
       (pred_4  obj_15 obj_31)
       (pred_12 obj_24)
       (pred_12 obj_12)
       (pred_12 obj_14)
       (pred_12 obj_11)
       (pred_12 obj_25)
       (pred_12 obj_06)
       (pred_12 obj_20)
       (pred_12 obj_22)
       (pred_12 obj_03)
       (pred_12 obj_28)
       (pred_12 obj_21)
       (pred_12 obj_10)
       (pred_12 obj_23)
       (pred_12 obj_19)
       (pred_12 obj_05)
       (pred_12 obj_01)
       (pred_12 obj_30)
       (pred_12 obj_17)
       (pred_12 obj_16)
       (pred_12 obj_29)
       (pred_12 obj_13)
       (pred_12 obj_04)

       (pred_6  obj_09 obj_27)
       (pred_6  obj_02 obj_07)
       (pred_6  obj_18 obj_31)
       (pred_8 obj_09 obj_03)
       (pred_8 obj_02 obj_28)
       (pred_8 obj_18 obj_17)
       (pred_5 obj_24)
    )

    (:goal (and
       (pred_8 obj_02 obj_29)
       (pred_8 obj_18 obj_14)
    ))
(:constraints
  (always (not (pred_5 obj_05)))
)
)

; plan
1. (op_5 obj_24 obj_12)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_12)
   goals met: 0 of 2
2. (op_5 obj_12 obj_20)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_20)
   goals met: 0 of 2
3. (op_5 obj_20 obj_28)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_28)
   goals met: 0 of 2
4. (op_5 obj_28 obj_19)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_19)
   goals met: 0 of 2
5. (op_5 obj_19 obj_16)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_16)
   goals met: 0 of 2
6. (op_5 obj_16 obj_17)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_17)
   goals met: 0 of 2
7. (op_3 obj_17 obj_18)
   deleted: (pred_8 obj_18 obj_17) (pred_1)
   added: (pred_3 obj_18)
   goals met: 0 of 2
8. (op_5 obj_17 obj_16)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_16)
   goals met: 0 of 2
9. (op_5 obj_16 obj_19)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_19)
   goals met: 0 of 2
10. (op_5 obj_19 obj_28)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_28)
   goals met: 0 of 2
11. (op_5 obj_28 obj_21)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_21)
   goals met: 0 of 2
12. (op_4 obj_21 obj_18)
   deleted: (pred_3 obj_18)
   added: (pred_1) (pred_8 obj_18 obj_21)
   goals met: 0 of 2
13. (op_5 obj_21 obj_28)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_28)
   goals met: 0 of 2
14. (op_3 obj_28 obj_02)
   deleted: (pred_8 obj_02 obj_28) (pred_1)
   added: (pred_3 obj_02)
   goals met: 0 of 2
15. (op_5 obj_28 obj_21)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_21)
   goals met: 0 of 2
16. (op_2 obj_21 obj_18 obj_02)
   deleted: (pred_3 obj_02) (pred_8 obj_18 obj_21)
   added: (pred_3 obj_18) (pred_8 obj_02 obj_21)
   goals met: 0 of 2
17. (op_5 obj_21 obj_22)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_22)
   goals met: 0 of 2
18. (op_5 obj_22 obj_14)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_14)
   goals met: 0 of 2
19. (op_4 obj_14 obj_18)
   deleted: (pred_3 obj_18)
   added: (pred_1) (pred_8 obj_18 obj_14)
   goals met: 1 of 2
20. (op_5 obj_14 obj_22)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_22)
   goals met: 1 of 2
21. (op_5 obj_22 obj_21)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_21)
   goals met: 1 of 2
22. (op_3 obj_21 obj_02)
   deleted: (pred_8 obj_02 obj_21) (pred_1)
   added: (pred_3 obj_02)
   goals met: 1 of 2
23. (op_5 obj_21 obj_28)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_28)
   goals met: 1 of 2
24. (op_5 obj_28 obj_19)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_19)
   goals met: 1 of 2
25. (op_5 obj_19 obj_16)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_16)
   goals met: 1 of 2
26. (op_5 obj_16 obj_29)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_29)
   goals met: 1 of 2
27. (op_4 obj_29 obj_02)
   deleted: (pred_3 obj_02)
   added: (pred_1) (pred_8 obj_02 obj_29)
   goals met: 2 of 2
